@echo off
title [Help]
echo.
echo.欢迎使用BAT-XD命令行X岛浏览器，接下来会介绍如何使用！
echo.
pause>nul
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
echo.
echo.运行MAIN.bat后会显示公告，按任意键后根据提示操作你会依次在下面页面输入口令操作：
echo.     板块列表
echo.     串列表
echo.     指定串显示
echo.
pause>nul
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
echo.
echo.进行操作的时候要输入指定操作口令才能能进行，一般要求操作输入时候会显示如下内容：
echo.
echo.[ #^<Num:ID^> ^| send ^<Num:ID^> ^| ref ^| back ^| pu ^| pd ^| page + ^| page - ^| page ^<Num:page^>]:_
echo.
echo.注意：根据每个操作页面不同显示口令也不同，请根据实际显示口令操作。
echo.
pause>nul
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
echo.口令用法如下：
echo.
echo.	#^<Num:ID^>           输入左侧板块ID/串号来进入查看
echo.	back                返回上一个操作页面
echo.	page                指定显示串列表/指定串页面，比如"page 2"就是显示该板块串列表/指定串的第二页
echo.                            但是可以使用"page +"或"page -"来查看下一页或者上一页
echo.	pd                  显示内容向上下
echo.	pu                  显示内容向上翻页
echo.	ref                 刷新显示页面
echo.	send ^<Num:ID^>       输入左侧板块ID/串号发布串或者回复串
echo.
echo.
pause>nul
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
echo.
echo.
echo.
echo.
echo.然后板块列表界面的话一般都是下面样式：
echo.
echo.	^|      WELCOME TO NMDBXD 
echo.	^|
echo.	^|
echo.	^|
echo.________^|__________________________________________________
echo. ID	^| 板块
echo.________^|__________________________________________________
echo.    	^|  [[[[ XXX ]]]] 
echo.000	^|   - XXXXX
echo.000	^|   - XXXXXXXXXXXX
echo.000	^|   - XXXXXXXXX
echo.
echo.左侧是板块ID，时间线ID则是"T"+"数字"组合
echo.
pause>nul
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
echo.
echo.然后是板块串列表样式：
echo.
echo.	^|      NMDBXD ^> 欢乐恶搞
echo.	^|
echo.	^|      页码: 1
echo.	^|
echo.	^|      我是欢乐恶搞板块介绍！
echo.	^|
echo.________^|__________________________________________________
echo. NO	^| 条目
echo.________^|__________________________________________________
echo.00000000^| A0A0A0A    2025-09-01(一)22:22:56 [SAGE]
echo.	^| 
echo.	^| 标题：无标题
echo.	^| 名字：无名氏
echo.	^| 回复： 2个 
echo.	^| [ IMAGE ] 
echo.	^| . . . . . . . . . . . . . . . . . . . . . . . . . 
echo.	^| 这里是正文内容
echo.	^| . . . . . . . . . . . . . . . . . . . . . . . . . 
echo.	^|  [ NO00000001 ^| A0A0A0B ] JMJP
echo.	^|  [ NO00000002 ^| A0A0A0C ] JMJP 
echo.	^|  [ NO00000003 ^| A0A0A0D ] JMJP 
echo.________^|__________________________________________________
echo.
echo.左侧是串ID
echo.每个串上面会依次展示：随机饼干名称、发串时间 、是否SAGE标志（如果有这个标志的话串一时间无法回复且再也没法顶起）
echo.而且会简要显示串回复内容
pause>nul
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
echo.
echo.最后是串的样子：
echo.
echo.	^|
echo.	^|
echo.	^|
echo.	^|      NMDBXD ^> 00000000 
echo.	^|
echo.	^|      页码: 1
echo.	^|
echo.________^|__________________________________________________
echo.00000000^| A0A0A0A    2025-02-08(六)11:20:22    [PO]
echo.	^|
echo.	^| 标题: 无标题
echo.	^| 名字: 无名氏
echo.	^| . . . . . . . . . . . . . . . . . . . . . . . . .
echo.	^| 这里是正文内容
echo.________^|__________________________________________________
echo. NO	^| 回复 (3)
echo.________^|__________________________________________________
echo.00000001^| A0A0A0B    2025-02-08(六)12:45:18
echo.	^|
echo.	^| 标题: 无标题
echo.	^| 名字: 无名氏
echo.	^| . . . . . . . . . . . . . . . . . . . . . . . . .
echo.	^| JMJP
echo.________^|__________________________________________________
echo.00000002^| A0A0A0c    2025-02-08(六)12:45:18
echo.	^|
echo.	^| 标题: 无标题
echo.	^| 名字: 无名氏
echo.	^| . . . . . . . . . . . . . . . . . . . . . . . . .
echo.	^| JMJP
echo.________^|__________________________________________________
echo.00000003^| A0A0A0d    2025-02-08(六)12:45:18
echo.	^|
echo.	^| 标题: 无标题
echo.	^| 名字: 无名氏
echo.	^| . . . . . . . . . . . . . . . . . . . . . . . . .
echo.	^| JMJP
echo.________^|__________________________________________________
echo.
echo.每个串的第一条内容会在每个页面上显示
echo.PO主发言的时候会在后面显示"[PO]"
pause>nul
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
echo.
echo.
echo.
echo.
echo.关于Cookie，在./bin/config.ini必须这样编写：
echo.
echo.[BAT_XD]
echo.xxxx
echo. ...
echo. ...
echo.xxxx
echo.COOKIE=G%%%%%%%%0C%%%%%%%%E9%%%%%%%%E4%%%%%%%%A6%%%%%%%%D1%%%%%%%%BCOV%%%%%%%%99%%%%%%%%3A%%%%%%%%21O%%%%%%%%B2%%%%%%%%A4z%%%%%%%%17U%%%%%%%%22Wq%%%%%%%%26%%%%%%%%CC%%%%%%%%FG
echo.
echo.
echo.
echo.一般cookie大多为这样内容：
echo.        G%%0C%%E9%%E4%%A6%%D1%%BCOV%%99%%3A%%21O%%B2%%A4z%%17U%%22Wq%%26%%CC%%FG
echo.但是在配置文件里面必须改为：
echo.        G%%%%%%%%0C%%%%%%%%E9%%%%%%%%E4%%%%%%%%A6%%%%%%%%D1%%%%%%%%BCOV%%%%%%%%99%%%%%%%%3A%%%%%%%%21O%%%%%%%%B2%%%%%%%%A4z%%%%%%%%17U%%%%%%%%22Wq%%%%%%%%26%%%%%%%%CC%%%%%%%%FG
echo.每个百分号要重复四遍，否则无法读取
echo.
pause>nul
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
echo.
echo.目前大概就是这样了，欢迎使用哦！
echo.
pause>nul
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
